DataProcessors/ПечатьТерможурнала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ПечатьТерможурнала</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/ПроцессПодПрограммыТермообработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ПроцессПодПрограммыТермообработки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПодПрограммыТермообработки</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПроцесса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПроцесса</Name>
					<Comment>весь процесс в минутах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПроцессаЧасов</Name>
					<Comment>(час.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПроцессаМинут</Name>
					<Comment>(мин.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПроцессаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураВКамере</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураВБатоне</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПШ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Влажность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПечатьТерможурнала/Ext/ManagerModule.bsl
// Модуль менеджера обработки ПечатьТерможурнала
// Логика перенесена из обработки УМК_ПечатьТерможурнала (1С77). // + claude

// Формирует табличный документ терможурнала по документу ЗагрузкаКамеры.
// Перенос процедуры СформироватьДокумент() из 1С77. // + claude
Функция СформироватьТерможурнал(СсылкаДокумента) Экспорт

	ТекПодпрограмма = СсылкаДокумента.ПодПрограмма;
	ТекТермокамера  = СсылкаДокумента.КамераТермообработки;
	ТекПрограмма    = ТекПодпрограмма.Программа;
	ПечатьКамеры    = НЕ ТекПодпрограмма.ВнеКамеры;

	// Продукция документа
	ТЗ_Продукция = СсылкаДокумента.ТМЦ.Выгрузить();

	// Процессы подпрограммы с расчетом времени начала/конца каждого процесса
	ТЗ_Процессы = ТаблицаПроцессов(СсылкаДокумента, ТекПодпрограмма);

	Макет  = ПолучитьМакет("ПечатьЖурнала");
	ТабДок = Новый ТабличныйДокумент;

	// --- Шапка
	Область = Макет.ПолучитьОбласть("Шапка|Основная");
	Область.Параметры.ПечДокумент = "№ " + СсылкаДокумента.Номер + " дата " + Формат(СсылкаДокумента.Дата, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(Область);

	Если ПечатьКамеры Тогда
		ТабДок.Присоединить(Макет.ПолучитьОбласть("Шапка|Камера"));
	КонецЕсли; // печать колонок камеры

	Для Каждого СтрПроцесса Из ТЗ_Процессы Цикл

		Область = Макет.ПолучитьОбласть("Шапка|ПроцессНачалоКонец");
		Область.Параметры.ПечПроцес = СтрПроцесса.Процесс.ВидПроцесса;
		ТабДок.Присоединить(Область);

		Если ЗначениеЗаполнено(СтрПроцесса.Процесс.ТемператураВКамере) Тогда
			ТабДок.Присоединить(Макет.ПолучитьОбласть("Шапка|ТемператураКамеры"));
		КонецЕсли; // температура в камере

		Если ЗначениеЗаполнено(СтрПроцесса.Процесс.ТемператураВБатоне) Тогда
			ТабДок.Присоединить(Макет.ПолучитьОбласть("Шапка|ТемператураВЦентре"));
		КонецЕсли; // температура в батоне

		Если ЗначениеЗаполнено(СтрПроцесса.Процесс.Влажность) Тогда
			ТабДок.Присоединить(Макет.ПолучитьОбласть("Шапка|Влажность"));
		КонецЕсли; // влажность

		Если ЗначениеЗаполнено(СтрПроцесса.Процесс.ПШ) Тогда
			ТабДок.Присоединить(Макет.ПолучитьОбласть("Шапка|ПШ"));
		КонецЕсли; // ПШ

	КонецЦикла; // по процессам — шапка

	Если ТекПрограмма.ПодписьТермист Тогда
		ТабДок.Присоединить(Макет.ПолучитьОбласть("Шапка|Подпись"));
	КонецЕсли; // подпись термиста

	Если ТекПрограмма.ПодписьТехнолог Тогда
		ТабДок.Присоединить(Макет.ПолучитьОбласть("Шапка|Подпись"));
	КонецЕсли; // подпись технолога

	Если ТекПрограмма.ПодписьВетеринар Тогда
		ТабДок.Присоединить(Макет.ПолучитьОбласть("Шапка|Подпись"));
	КонецЕсли; // подпись ветеринара

	Если ТекПрограмма.ПодписьКладовщик Тогда
		ТабДок.Присоединить(Макет.ПолучитьОбласть("Шапка|Подпись"));
	КонецЕсли; // подпись кладовщика

	// --- Строки продукции (учет страниц для постобработки объединения ячеек)
	ТЗ_Страниц = Новый ТаблицаЗначений;
	ТЗ_Страниц.Колонки.Добавить("Страница", Новый ОписаниеТипов("Число"));
	ТЗ_Страниц.Колонки.Добавить("Строка",   Новый ОписаниеТипов("Число"));

	КвоСтраниц         = 1;
	КвоСтрокНаСтранице = 0;
	КвоСтрок           = 0;
	СтрокаСтраницы          = ТЗ_Страниц.Добавить();
	СтрокаСтраницы.Страница = КвоСтраниц;

	// Предыдущий документ загрузки (в 1С77 — основание вида УМК_ЗагрузкаКамеры)
	ПечПредидущийДок = "";
	Если ЗначениеЗаполнено(СсылкаДокумента.ДокументОснование) Тогда
		ПечПредидущийДок = "№ " + СсылкаДокумента.ДокументОснование.Номер
			+ " від " + Формат(СсылкаДокумента.ДокументОснование.Дата, "ДФ=dd.MM.yyyy");
	КонецЕсли; // документ-основание

	Для Каждого СтрПрод Из ТЗ_Продукция Цикл

		КвоСтрок = КвоСтрок + 1;

		Если КвоСтрок = 15 Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КвоСтраниц              = КвоСтраниц + 1;
			СтрокаСтраницы          = ТЗ_Страниц.Добавить();
			СтрокаСтраницы.Страница = КвоСтраниц;
			КвоСтрокНаСтранице      = 0;
		КонецЕсли; // новая страница

		ПечТМЦ = СокрЛП(СтрПрод.ТМЦ.НаименованиеПолное);
		Если ПустаяСтрока(ПечТМЦ) Тогда
			ПечТМЦ = СокрЛП(СтрПрод.ТМЦ.Наименование);
		КонецЕсли; // полное наименование не заполнено

		Область = Макет.ПолучитьОбласть("Строка|Основная");
		Область.Параметры.ПечТМЦ          = ПечТМЦ;
		Область.Параметры.ПечКвоРам       = СтрПрод.КвоРам;
		Область.Параметры.ПечВидОболочки  = СтрПрод.ТМЦ.ВидОболочки;
		Область.Параметры.ПечПредидущийДок = ПечПредидущийДок;
		ТабДок.Вывести(Область);

		КвоСтрокНаСтранице    = КвоСтрокНаСтранице + 1;
		СтрокаСтраницы.Строка = КвоСтрокНаСтранице;

		Если ПечатьКамеры Тогда
			Область = Макет.ПолучитьОбласть("Строка|Камера");
			Область.Параметры.ПечНомерКамеры    = ТекТермокамера.Код;
			Область.Параметры.ПечНомерПрограммы = ТекПодпрограмма.Код;
			ТабДок.Присоединить(Область);
		КонецЕсли; // печать колонок камеры

		Для Каждого СтрПроцесса Из ТЗ_Процессы Цикл

			ПечНачало = Формат(СтрПроцесса.ДатаНачала, "ДФ=dd.MM.yy") + " "
				+ ДвеЦифры(СтрПроцесса.ЧасыНачала) + ":" + ДвеЦифры(СтрПроцесса.МинутыНачала);
			ПечКонец  = Формат(СтрПроцесса.ДатаКонца, "ДФ=dd.MM.yy") + " "
				+ ДвеЦифры(СтрПроцесса.ЧасыКонца) + ":" + ДвеЦифры(СтрПроцесса.МинутыКонца);

			Область = Макет.ПолучитьОбласть("Строка|ПроцессНачалоКонец");
			Область.Параметры.ПечНачало = ПечНачало;
			Область.Параметры.ПечКонец  = ПечКонец;
			ТабДок.Присоединить(Область);

			Если ЗначениеЗаполнено(СтрПроцесса.Процесс.ТемператураВКамере) Тогда
				Область = Макет.ПолучитьОбласть("Строка|ТемператураКамеры");
				Область.Параметры.ПечТемператураВКамере = СтрПроцесса.Процесс.ТемператураВКамере;
				ТабДок.Присоединить(Область);
			КонецЕсли; // температура в камере

			Если ЗначениеЗаполнено(СтрПроцесса.Процесс.ТемператураВБатоне) Тогда
				Область = Макет.ПолучитьОбласть("Строка|ТемператураВЦентре");
				Область.Параметры.ПечТемператураВЦентре = СтрПроцесса.Процесс.ТемператураВБатоне;
				ТабДок.Присоединить(Область);
			КонецЕсли; // температура в батоне

			Если ЗначениеЗаполнено(СтрПроцесса.Процесс.Влажность) Тогда
				Область = Макет.ПолучитьОбласть("Строка|Влажность");
				Область.Параметры.ПечВлажность = СтрПроцесса.Процесс.Влажность;
				ТабДок.Присоединить(Область);
			КонецЕсли; // влажность

			Если ЗначениеЗаполнено(СтрПроцесса.Процесс.ПШ) Тогда
				Область = Макет.ПолучитьОбласть("Строка|ПШ");
				Область.Параметры.ПечПШ = СтрПроцесса.Процесс.ПШ;
				ТабДок.Присоединить(Область);
			КонецЕсли; // ПШ

		КонецЦикла; // по процессам — строка

		Если ТекПрограмма.ПодписьТермист Тогда
			ТабДок.Присоединить(Макет.ПолучитьОбласть("Строка|Подпись"));
		КонецЕсли; // подпись термиста

		Если ТекПрограмма.ПодписьТехнолог Тогда
			ТабДок.Присоединить(Макет.ПолучитьОбласть("Строка|Подпись"));
		КонецЕсли; // подпись технолога

		Если ТекПрограмма.ПодписьВетеринар Тогда
			ТабДок.Присоединить(Макет.ПолучитьОбласть("Строка|Подпись"));
		КонецЕсли; // подпись ветеринара

		Если ТекПрограмма.ПодписьКладовщик Тогда
			ТабДок.Присоединить(Макет.ПолучитьОбласть("Строка|Подпись"));
		КонецЕсли; // подпись кладовщика

	КонецЦикла; // по продукции

	// --- Итог
	Область = Макет.ПолучитьОбласть("Итог");
	Область.Параметры.ПечИтогоРам = ВернутьКвоРам(ТЗ_Продукция);
	ТабДок.Вывести(Область);

	// --- Постобработка: объединение ячеек колонок по страницам
	ШапкаСтрокиНачала = 6;
	НомСтрокиНачала   = 0;
	НомСтрокиКонец    = 0;
	ТекКолонка        = 3;

	Для Каждого СтрСтраницы Из ТЗ_Страниц Цикл

		ТекКолонка = 3;

		Если СтрСтраницы.Страница = 1 Тогда
			НомСтрокиНачала = ШапкаСтрокиНачала * СтрСтраницы.Страница + (СтрСтраницы.Страница - 1) * 27;
		Иначе
			НомСтрокиНачала = 6 + (СтрСтраницы.Страница - 1) * 28;
		КонецЕсли; // расчет строки начала данных страницы
		НомСтрокиКонец = НомСтрокиНачала + СтрСтраницы.Строка * 2 - 1;

		Если ПечатьКамеры Тогда
			ТекКолонка = ТекКолонка + 1;
			ТабДок.Область(НомСтрокиНачала, ТекКолонка, НомСтрокиКонец, ТекКолонка).Объединить();
			ТекКолонка = ТекКолонка + 1;
			ТабДок.Область(НомСтрокиНачала, ТекКолонка, НомСтрокиКонец, ТекКолонка).Объединить();
		КонецЕсли; // колонки камеры

		Для Каждого СтрПроцесса Из ТЗ_Процессы Цикл

			ТекКолонка = ТекКолонка + 1;
			ТабДок.Область(НомСтрокиНачала, ТекКолонка, НомСтрокиКонец, ТекКолонка).Объединить();
			ТекКолонка = ТекКолонка + 1;
			ТабДок.Область(НомСтрокиНачала, ТекКолонка, НомСтрокиКонец, ТекКолонка).Объединить();

			Если ЗначениеЗаполнено(СтрПроцесса.Процесс.ТемператураВКамере) Тогда
				ТекКолонка = ТекКолонка + 1;
				ТабДок.Область(НомСтрокиНачала, ТекКолонка, НомСтрокиКонец, ТекКолонка).Объединить();
			КонецЕсли; // температура в камере

			Если ЗначениеЗаполнено(СтрПроцесса.Процесс.ТемператураВБатоне) Тогда
				ТекКолонка = ТекКолонка + 1;
				ТабДок.Область(НомСтрокиНачала, ТекКолонка, НомСтрокиКонец, ТекКолонка).Объединить();
			КонецЕсли; // температура в батоне

			Если ЗначениеЗаполнено(СтрПроцесса.Процесс.Влажность) Тогда
				ТекКолонка = ТекКолонка + 1;
				ТабДок.Область(НомСтрокиНачала, ТекКолонка, НомСтрокиКонец, ТекКолонка).Объединить();
			КонецЕсли; // влажность

			Если ЗначениеЗаполнено(СтрПроцесса.Процесс.ПШ) Тогда
				ТекКолонка = ТекКолонка + 1;
				ТабДок.Область(НомСтрокиНачала, ТекКолонка, НомСтрокиКонец, ТекКолонка).Объединить();
			КонецЕсли; // ПШ

		КонецЦикла; // по процессам — объединение

		Если ТекПрограмма.ПодписьТермист Тогда
			ТекКолонка = ТекКолонка + 1;
			ТабДок.Область(НомСтрокиНачала, ТекКолонка, НомСтрокиКонец, ТекКолонка).Объединить();
		КонецЕсли; // подпись термиста

		Если ТекПрограмма.ПодписьТехнолог Тогда
			ТекКолонка = ТекКолонка + 1;
			ТабДок.Область(НомСтрокиНачала, ТекКолонка, НомСтрокиКонец, ТекКолонка).Объединить();
		КонецЕсли; // подпись технолога

		Если ТекПрограмма.ПодписьВетеринар Тогда
			ТекКолонка = ТекКолонка + 1;
			ТабДок.Область(НомСтрокиНачала, ТекКолонка, НомСтрокиКонец, ТекКолонка).Объединить();
		КонецЕсли; // подпись ветеринара

		Если ТекПрограмма.ПодписьКладовщик Тогда
			ТекКолонка = ТекКолонка + 1;
			ТабДок.Область(НомСтрокиНачала, ТекКолонка, НомСтрокиКонец, ТекКолонка).Объединить();
		КонецЕсли; // подпись кладовщика

	КонецЦикла; // по страницам

	Если НомСтрокиКонец = 7 Тогда
		ТабДок.Область(НомСтрокиНачала, 1, НомСтрокиКонец, ТекКолонка).ВысотаСтроки = 25;
	КонецЕсли; // единственная строка данных

	// --- Параметры печати
	ТабДок.ПовторятьПриПечатиСтроки = ТабДок.Область(1, , 5, );
	Если ПечатьКамеры Тогда
		ТабДок.ПовторятьПриПечатиСтолбцы = ТабДок.Область(, 1, , 5);
	Иначе
		ТабДок.ПовторятьПриПечатиСтолбцы = ТабДок.Область(, 1, , 3);
	КонецЕсли; // повторяемые колонки

	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ПолеСлева          = 0;
	ТабДок.ПолеСверху         = 0;
	ТабДок.ПолеСправа         = 20;
	ТабДок.ПолеСнизу          = 0;
	ТабДок.ТолькоПросмотр     = Истина;

	Возврат ТабДок;

КонецФункции // СформироватьТерможурнал // + claude

// Таблица процессов подпрограммы с расчетом дат/времени начала и конца.
// Перенос цикла по СпрПроцессы из СформироватьДокумент() 1С77. // + claude
Функция ТаблицаПроцессов(СсылкаДокумента, ТекПодпрограмма)

	ТЗ_Процессы = Новый ТаблицаЗначений;
	ТЗ_Процессы.Колонки.Добавить("Процесс",      Новый ОписаниеТипов("СправочникСсылка.ПроцессПодПрограммыТермообработки"));
	ТЗ_Процессы.Колонки.Добавить("ДатаНачала",   Новый ОписаниеТипов("Дата"));
	ТЗ_Процессы.Колонки.Добавить("ЧасыНачала",   Новый ОписаниеТипов("Число"));
	ТЗ_Процессы.Колонки.Добавить("МинутыНачала", Новый ОписаниеТипов("Число"));
	ТЗ_Процессы.Колонки.Добавить("ДатаКонца",    Новый ОписаниеТипов("Дата"));
	ТЗ_Процессы.Колонки.Добавить("ЧасыКонца",    Новый ОписаниеТипов("Число"));
	ТЗ_Процессы.Колонки.Добавить("МинутыКонца",  Новый ОписаниеТипов("Число"));

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Процессы.Ссылка КАК Процесс,
		|	Процессы.ДлинаПроцесса КАК ДлинаПроцесса
		|ИЗ
		|	Справочник.ПроцессПодПрограммыТермообработки КАК Процессы
		|ГДЕ
		|	Процессы.Владелец = &Подпрограмма
		|	И НЕ Процессы.ПометкаУдаления
		|	И ЕСТЬNULL(Процессы.ВидПроцесса.ЗанимаетКамеруБезОтчета, ЛОЖЬ) = ЛОЖЬ
		|УПОРЯДОЧИТЬ ПО
		|	Процессы.Код";
	Запрос.УстановитьПараметр("Подпрограмма", ТекПодпрограмма);
	Выборка = Запрос.Выполнить().Выбрать();

	ТекДата   = НачалоДня(СсылкаДокумента.Дата);
	ТекЧасы   = СсылкаДокумента.ЗагруженаЧасы;
	ТекМинуты = СсылкаДокумента.ЗагруженаМинуты;

	Пока Выборка.Следующий() Цикл

		НоваяСтрока              = ТЗ_Процессы.Добавить();
		НоваяСтрока.Процесс      = Выборка.Процесс;
		НоваяСтрока.ДатаНачала   = ТекДата;
		НоваяСтрока.ЧасыНачала   = ТекЧасы;
		НоваяСтрока.МинутыНачала = ТекМинуты;

		// ДлинаПроцесса хранится в минутах
		ОбщоМинут    = ТекЧасы * 60 + ТекМинуты + Выборка.ДлинаПроцесса;
		РезДни       = Цел(ОбщоМинут / 1440);
		ОстатокМинут = ОбщоМинут - РезДни * 1440;

		НоваяСтрока.ДатаКонца   = ТекДата + РезДни * 86400;
		НоваяСтрока.ЧасыКонца   = Цел(ОстатокМинут / 60);
		НоваяСтрока.МинутыКонца = ОстатокМинут - Цел(ОстатокМинут / 60) * 60;

		ТекДата   = НоваяСтрока.ДатаКонца;
		ТекЧасы   = НоваяСтрока.ЧасыКонца;
		ТекМинуты = НоваяСтрока.МинутыКонца;

	КонецЦикла; // по выборке процессов

	Возврат ТЗ_Процессы;

КонецФункции // ТаблицаПроцессов // + claude

// Число в строку из двух цифр с ведущим нулем (аналог глДополнитьСтроку 1С77)
Функция ДвеЦифры(Число)

	Возврат Прав("0" + Формат(Число, "ЧГ="), 2);

КонецФункции // ДвеЦифры // + claude

// Итоговое количество рам: свертка по виду рамы с округлением вверх.
// Перенос функции ВернутьКвоРам() из 1С77. // + claude
Функция ВернутьКвоРам(ТЗ_Продукция)

	ТЗ_Рамы = ТЗ_Продукция.Скопировать(, "ВидРамы, КвоРам");
	ТЗ_Рамы.Свернуть("ВидРамы", "КвоРам");

	ИтРам = 0;
	Для Каждого СтрРамы Из ТЗ_Рамы Цикл
		ИтРам = ИтРам + Цел(СтрРамы.КвоРам) + ?(СтрРамы.КвоРам > Цел(СтрРамы.КвоРам), 1, 0); // округление вверх
	КонецЦикла; // по видам рам

	Возврат Формат(ИтРам, "ЧДЦ=0; ЧГ=");

КонецФункции // ВернутьКвоРам // + claude
